# Автор: MN2
# Код для расчета ИМТ

name = input("Привет, укажи свое имя! ")
height = int(input("Для расчета ИМТ потребуется твой рост: "))
weight = int(input("И вес: "))

imt = weight / (height / 100) ** 2

print(name, ", вот твой ИМТ: ", round(imt, 2), sep='')

if imt < 18.5:
    print("Дефицит массы тела (нужно больше кушать).")
elif 18.5 <= imt < 25:
    print("Нормальный вес (отлично, так держать!).")
elif 25 <= imt < 30:
    print("Избыточная масса тела (стоит урезать сладкое).")
elif imt >= 30:
    print("Ожирение (пора активно заняться спортом).")
