# Автор: MN2
# Код для вычисления суммы цифр числа (до 12 знаков)

x = abs(int(input("Введите число: ")))  

a = x % 10
b = (x % 100) // 10
c = (x % 1000) // 100
d = (x % 10000) // 1000
e = (x % 100000) // 10000
f = (x % 1000000) // 100000
g = (x % 10000000) // 1000000
h = (x % 100000000) // 10000000
i = (x % 1000000000) // 100000000
j = (x % 10000000000) // 1000000000
k = (x % 100000000000) // 10000000000
l = x // 100000000000

y = a + b + c + d + e + f + g + h + i + j + k + l

print("Сумма =", y)
